const productNewsData = [
    {
        id: "003",
        date: "2024.08.07",
        title: "新商品「XXX」を発売します(クリック可能サンプル)",
        summary: "高性能な新製品「XXX」の発売が決定いたしました。詳細はこちらをご確認ください。",
        url: "../../html/products/CAR_ACCESSORY/sph/sph.htm"
    },
    {
        id: "002",
        date: "2024.07.25",
        title: "夏季休業のお知らせsesesese",
        summary: "誠に勝手ながら、以下の期間を夏季休業とさせていただきます。ご不便をおかけしますが、ご理解のほどよろしくお願いいたします。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    },
    {
        id: "001",
        date: "2024.07.15",
        title: "ウェブサイトをリニューアルしました",
        summary: "この度、ウェブサイトをより見やすく、使いやすいデザインにリニューアルしました。",
        url: ""
    }
];