const car_type = `
{
    "トヨタ": {
        "maker": "トヨタ",
        "models": [
            {
                "name": "ヤリス",
                "model_number": "{MXPA10,MXPH10}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "アクア",
                "model_number": "{MXPK10}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "シエンタ",
                "model_number": "{MXPC10,MXPL10}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "プリウス",
                "model_number": "{MXWH60,ZVW60}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ルーミー",
                "model_number": "{M900A,M910A}",
                "years": [
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "カローラ",
                "model_number": "{ZRE212,ZWE211}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "カローラクロス",
                "model_number": "{ZSG10,ZVG11}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ノア",
                "model_number": "{ZWR90W,ZRR90W}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ヴォクシー",
                "model_number": "{ZWR90W,ZRR90W}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "アルファード",
                "model_number": "{AGH40W,AAH40W}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ハリアー",
                "model_number": "{MXUA80,AXUH80}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "RAV4",
                "model_number": "{MXAA50,AXAH50}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ライズ",
                "model_number": "{A200A,A210A}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ランドクルーザープラド",
                "model_number": "{GDJ150W,TRJ150W}",
                "years": [
                    "H21 / 2009",
                    "H22 / 2010",
                    "H23 / 2011",
                    "H24 / 2012",
                    "H25 / 2013",
                    "H26 / 2014",
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ハイエース",
                "model_number": "{GDH200,TRH200}",
                "years": [
                    "H16 / 2004",
                    "H17 / 2005",
                    "H18 / 2006",
                    "H19 / 2007",
                    "H20 / 2008",
                    "H21 / 2009",
                    "H22 / 2010",
                    "H23 / 2011",
                    "H24 / 2012",
                    "H25 / 2013",
                    "H26 / 2014",
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "クラウン",
                "model_number": "{AZSH35,TZSH35}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "ホンダ": {
        "maker": "ホンダ",
        "models": [
            {
                "name": "N-BOX",
                "model_number": "{JF5,JF6}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "N-WGN",
                "model_number": "{JH3,JH4}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "フィット",
                "model_number": "{GR1,GR3}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ヴェゼル",
                "model_number": "{RV3,RV5}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ステップワゴン",
                "model_number": "{RP6,RP7}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "フリード",
                "model_number": "{GB5,GB7}",
                "years": [
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "シビック",
                "model_number": "{FL1,FL4}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ZR-V",
                "model_number": "{RZ3,RZ5}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "ニッサン": {
        "maker": "ニッサン",
        "models": [
            {
                "name": "ノート",
                "model_number": "{E13,SNE13}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "セレナ",
                "model_number": "{GC28,FC28}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ルークス",
                "model_number": "{B44A,B47A}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "キックス",
                "model_number": "{P15}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "エクストレイル",
                "model_number": "{T33}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "スカイライン",
                "model_number": "{RV37}",
                "years": [
                    "H26 / 2014",
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "デイズ",
                "model_number": "{B43W,B46W}",
                "years": [
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "スズキ": {
        "maker": "スズキ",
        "models": [
            {
                "name": "スイフト",
                "model_number": "{ZC#3S,ZD#3S}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ジムニー",
                "model_number": "{JB64W}",
                "years": [
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ワゴンR",
                "model_number": "{MH55S,MH95S}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "スペーシア",
                "model_number": "{MK53S}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ハスラー",
                "model_number": "{MR52S,MR92S}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ソリオ",
                "model_number": "{MA27S,MA37S}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "マツダ": {
        "maker": "マツダ",
        "models": [
            {
                "name": "MAZDA2",
                "model_number": "{DJLFS,DJLAS}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "MAZDA3",
                "model_number": "{BPFP,BP5P}",
                "years": [
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "CX-30",
                "model_number": "{DMEP,DM8P}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "CX-5",
                "model_number": "{KFEP,KF2P}",
                "years": [
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "CX-60",
                "model_number": "{KH5P,KH3R3}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ロードスター",
                "model_number": "{ND5RC}",
                "years": [
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "スバル": {
        "maker": "スバル",
        "models": [
            {
                "name": "レヴォーグ",
                "model_number": "{VN5}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "インプレッサ",
                "model_number": "{GU2,GU3}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "クロストレック",
                "model_number": "{GUE}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "フォレスター",
                "model_number": "{SK5,SKE}",
                "years": [
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "BRZ",
                "model_number": "{ZD8}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "ダイハツ": {
        "maker": "ダイハツ",
        "models": [
            {
                "name": "タント",
                "model_number": "{LA650S,LA660S}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "タフト",
                "model_number": "{LA900S,LA910S}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ロッキー",
                "model_number": "{A200S,A210S}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ムーヴキャンバス",
                "model_number": "{LA850S,LA860S}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "コペン",
                "model_number": "{LA400K}",
                "years": [
                    "H26 / 2014",
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "ミツビシ": {
        "maker": "ミツビシ",
        "models": [
            {
                "name": "デリカD:5",
                "model_number": "{CV1W}",
                "years": [
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "アウトランダー",
                "model_number": "{GN0W}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "eKクロス",
                "model_number": "{B35W,B38W}",
                "years": [
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "エクリプスクロス",
                "model_number": "{GK1W}",
                "years": [
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "レクサス": {
        "maker": "レクサス",
        "models": [
            {
                "name": "IS",
                "model_number": "{ASE30,AVE30}",
                "years": [
                    "H25 / 2013",
                    "H26 / 2014",
                    "H27 / 2015",
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "ES",
                "model_number": "{AXZH10}",
                "years": [
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "NX",
                "model_number": "{AAZH20,TAZA25}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "RX",
                "model_number": "{TAHA10,TALA15}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "LX",
                "model_number": "{VJA310W}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "GX",
                "model_number": "{OJA300A}",
                "years": [
                    "R6 / 2024"
                ]
            }
        ]
    },
    "メルセデス・ベンツ": {
        "maker": "メルセデス・ベンツ",
        "models": [
            {
                "name": "Aクラス",
                "model_number": "{W177}",
                "years": [
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "Cクラス",
                "model_number": "{W206}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "Eクラス",
                "model_number": "{W214}",
                "years": [
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "GLA",
                "model_number": "{H247}",
                "years": [
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "GLC",
                "model_number": "{X254}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "BMW": {
        "maker": "BMW",
        "models": [
            {
                "name": "1シリーズ",
                "model_number": "{F40}",
                "years": [
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "3シリーズ",
                "model_number": "{G20}",
                "years": [
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "X1",
                "model_number": "{U11}",
                "years": [
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "X3",
                "model_number": "{G01}",
                "years": [
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    },
    "アウディ": {
        "maker": "アウディ",
        "models": [
            {
                "name": "A3",
                "model_number": "{8Y}",
                "years": [
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "Q2",
                "model_number": "{GA}",
                "years": [
                    "H28 / 2016",
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            },
            {
                "name": "Q5",
                "model_number": "{FY}",
                "years": [
                    "H29 / 2017",
                    "H30 / 2018",
                    "H31 / 2019",
                    "R1 / 2019",
                    "R2 / 2020",
                    "R3 / 2021",
                    "R4 / 2022",
                    "R5 / 2023",
                    "R6 / 2024"
                ]
            }
        ]
    }
}
`;